#### Terraform Format and Style 🖌`success`

<details><summary>Format Output</summary>

```


```

</details>

#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.terraform_remote_state.stacks_platform: Reading...
data.terraform_remote_state.stacks: Reading...
data.terraform_remote_state.stacks_platform: Read complete after 0s
data.terraform_remote_state.stacks: Read complete after 0s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_record.bastion_private will be created
  + resource "aws_route53_record" "bastion_private" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "bastion.[null]"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "A"
      + zone_id         = jsonencode(
            [
              + null,
            ]
        )
    }

  # aws_route53_record.bastion_public will be created
  + resource "aws_route53_record" "bastion_public" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "bastion-dev.[null]"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "A"
      + zone_id         = jsonencode(
            [
              + null,
            ]
        )
    }

  # aws_security_group.bastion_public_ssh will be created
  + resource "aws_security_group" "bastion_public_ssh" {
      + arn                    = (known after apply)
      + description            = "Permit public ssh access on bastion in env: dev"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow ICMP in egress just to attach this rule to default ingress in others instances"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "bastion_public_ssh-dev"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "ssh"
        }
      + tags_all               = {
          + "Env"            = "dev"
          + "ManagedBy"      = "Terraform"
          + "Name"           = "ssh"
          + "OrchestratedBy" = "Terramate"
          + "Stack"          = "bastion"
          + "StackPath"      = "/stacks/platform/bastion"
        }
      + vpc_id                 = jsonencode(
            [
              + null,
            ]
        )
    }

  # aws_security_group.bastion_uptimerobot_ssh will be created
  + resource "aws_security_group" "bastion_uptimerobot_ssh" {
      + arn                    = (known after apply)
      + description            = "Permit uptimerobot ssh monitoring on bastion in env: dev"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow ICMP in egress just to attach this rule to default ingress in others instances"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "bastion_uptimerobot_ssh-dev"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "uptime-robot"
        }
      + tags_all               = {
          + "Env"            = "dev"
          + "ManagedBy"      = "Terraform"
          + "Name"           = "uptime-robot"
          + "OrchestratedBy" = "Terramate"
          + "Stack"          = "bastion"
          + "StackPath"      = "/stacks/platform/bastion"
        }
      + vpc_id                 = jsonencode(
            [
              + null,
            ]
        )
    }

  # module.ec2-instance.aws_instance.this[0] will be created
  + resource "aws_instance" "this" {
      + ami                                  = jsonencode(
            [
              + null,
            ]
        )
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = jsonencode(
            [
              + null,
            ]
        )
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.small"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "terraform-aws-dev"
      + monitoring                           = false
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = jsonencode(
            [
              + null,
            ]
        )
      + tags                                 = {
          + "App"  = "bastion"
          + "Name" = "bastion01-dev"
          + "Type" = "t3.small"
        }
      + tags_all                             = {
          + "App"            = "bastion"
          + "Env"            = "dev"
          + "ManagedBy"      = "Terraform"
          + "Name"           = "bastion01-dev"
          + "OrchestratedBy" = "Terramate"
          + "Stack"          = "bastion"
          + "StackPath"      = "/stacks/platform/bastion"
          + "Type"           = "t3.small"
        }
      + tenancy                              = (known after apply)
      + user_data                            = "1469e10c2d13a9b236c8bf7946bc26302c62b288"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + volume_tags                          = {
          + "Name" = "bastion01-dev"
        }
      + vpc_security_group_ids               = (known after apply)

      + capacity_reservation_specification {
          + capacity_reservation_preference = (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id                 = (known after apply)
              + capacity_reservation_resource_group_arn = (known after apply)
            }
        }

      + credit_specification {}

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + maintenance_options {
          + auto_recovery = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "optional"
          + instance_metadata_tags      = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_card_index    = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + private_dns_name_options {
          + enable_resource_name_dns_a_record    = (known after apply)
          + enable_resource_name_dns_aaaa_record = (known after apply)
          + hostname_type                        = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + timeouts {}
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @kaio6fellipe, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform plan`*